read_verilog src/rc2014_interface_top.v src/rom.v src/debouncer.v src/uart_tx.v src/sync_reset.v
synth_ice40 -blif chip.blif -top rc2014_interface_top
write_json chip.json